1s/ERP/Conf/Documents/Лико_ПланУпаковки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ПланУпаковки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_ПланированиеУпаковки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыДокументовПланУпаковки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Намотка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Намотка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаОтгрузку</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Лико_ЗаявкаНаОтгрузку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧестныйЗнак</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ЧестныйЗнак</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_ПланированиеУпаковки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_ПланированиеУпаковки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоУпаковка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПеремотка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаявкаНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Намотка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Намотка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧестныйЗнак</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ЧестныйЗнак</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыДокументовПланУпаковки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыДокументовПланУпаковки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Упаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемотка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпаковкаИПеремотка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкладГП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ПланУпаковки/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Лико_ПланированиеУпаковки Приход или Расход
	// Чтобы не получать для каждой строки номенклатуру из характеристики, получим данные одним запросом
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Лико_ПланУпаковкиТовары.Дата = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Лико_ПланУпаковкиТовары.Ссылка.Дата
		|		ИНАЧЕ Лико_ПланУпаковкиТовары.Дата
		|	КОНЕЦ КАК Период,
		|	ВЫБОР
		|		КОГДА Лико_ПланУпаковкиТовары.Ссылка.ВидДвижения
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ВЫРАЗИТЬ(Лико_ПланУпаковкиТовары.Характеристика.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
		|	Лико_ПланУпаковкиТовары.Характеристика КАК Характеристика,
		|	Лико_ПланУпаковкиТовары.Намотка КАК Намотка,
		|	Лико_ПланУпаковкиТовары.Город КАК Город,
		|	СУММА(ВЫБОР
		|			КОГДА Лико_ПланУпаковкиТовары.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыДокументовПланУпаковки.Упаковка)
		|					ИЛИ Лико_ПланУпаковкиТовары.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыДокументовПланУпаковки.УпаковкаИПеремотка)
		|				ТОГДА Лико_ПланУпаковкиТовары.Количество
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоУпаковка,
		|	СУММА(ВЫБОР
		|			КОГДА Лико_ПланУпаковкиТовары.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыДокументовПланУпаковки.Перемотка)
		|					ИЛИ Лико_ПланУпаковкиТовары.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыДокументовПланУпаковки.УпаковкаИПеремотка)
		|				ТОГДА Лико_ПланУпаковкиТовары.Количество
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоПеремотка,
		|	Лико_ПланУпаковкиТовары.ЗаявкаНаОтгрузку КАК ЗаявкаНаОтгрузку,
		|	СУММА(ВЫБОР
		|			КОГДА Лико_ПланУпаковкиТовары.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыДокументовПланУпаковки.Упаковка)
		|					ИЛИ Лико_ПланУпаковкиТовары.Ссылка.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыДокументовПланУпаковки.УпаковкаИПеремотка)
		|				ТОГДА Лико_ПланУпаковкиТовары.Количество
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоСклад
		|ИЗ
		|	Документ.Лико_ПланУпаковки.Товары КАК Лико_ПланУпаковкиТовары
		|ГДЕ
		|	Лико_ПланУпаковкиТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА Лико_ПланУпаковкиТовары.Дата = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Лико_ПланУпаковкиТовары.Ссылка.Дата
		|		ИНАЧЕ Лико_ПланУпаковкиТовары.Дата
		|	КОНЕЦ,
		|	ВЫРАЗИТЬ(Лико_ПланУпаковкиТовары.Характеристика.Владелец КАК Справочник.Номенклатура),
		|	Лико_ПланУпаковкиТовары.Характеристика,
		|	Лико_ПланУпаковкиТовары.Намотка,
		|	Лико_ПланУпаковкиТовары.Город,
		|	Лико_ПланУпаковкиТовары.ЗаявкаНаОтгрузку,
		|	ВЫБОР
		|		КОГДА Лико_ПланУпаковкиТовары.Ссылка.ВидДвижения
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = Запрос.Выполнить().Выбрать();
	Движения.Лико_ПланированиеУпаковки.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.Лико_ПланированиеУпаковки.Добавить(), Выборка);
	КонецЦикла;

КонецПроцедуры
